skillfair-2/app/controllers/categories_controller.rb

    def set_category
      @category = Category.find(params.expect(:id))
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1